/*
 * @Description:
 * @Author: waaaly
 * @Github: https://github.com/waaaly
 * @Date: 2021-07-30 14:58:11
 * @LastEditTime: 2021-08-02 11:17:32
 */

export default {
    id: '董事长',
    children: [
        {
            id: '质量授权人',
            children: [
                {
                    id: '财务成本中心',
                    children: [
                        { id: '会计部' },
                        { id: '税务部' },
                        { id: '资金部' },
                        { id: '计财部' },
                    ],
                },
                {
                    id: '质量费用中心',
                    children: [{ id: '质量保证部' }, { id: '质量控制部' }],
                },
                {
                    id: '行政费用中心',
                    children: [
                        { id: '人力资源部' },
                        {
                            id: '办公室',
                            children: [{ id: '后勤部' }],
                        },
                    ],
                },
                {
                    id: '技术费用中心',
                    children: [{ id: '技术部' }],
                },
                {
                    id: '信息技术费用中心',
                },
                {
                    id: '研发中心',
                },
                {
                    id: '安全生产领导小组',
                },
                {
                    id: '质量小组',
                },
            ],
        },
        {
            id: '董事会机构',
            children: [
                {
                    id: '长中期经营计划',
                    children: [
                        { id: '海外市场' },
                        { id: '眼药水' },
                        { id: '消毒药剂' },
                        { id: '医药原料公司' },
                        { id: '研发子公司' },
                        { id: '包装子公司' },
                        {
                            id: '总经理',
                            children: [
                                {
                                    id: '经营企划部',
                                    children: [
                                        { id: '战略委员会' },
                                        {
                                            id: '品牌运营部',
                                            children: [
                                                { id: '企划部' },
                                                { id: '推广部' },
                                                { id: '医学部' },
                                            ],
                                        },
                                    ],
                                },
                                {
                                    id: '经营管理部1',
                                },
                                {
                                    id: '安全生产利润中心',
                                    children: [
                                        { id: '设备管理部1' },
                                        { id: '安全生产管理部1' },
                                        {
                                            id: '综合制剂利润中心',
                                            children: [
                                                { id: '设备主任1' },
                                                { id: '技术主任1' },
                                                { id: '综合制剂车间' },
                                            ],
                                        },
                                        {
                                            id: '口服固体利润中心',
                                            children: [
                                                { id: '设备主任2' },
                                                { id: '技术主任2' },
                                                { id: '口服固体车间' },
                                            ],
                                        },
                                        {
                                            id: '注射剂利润中心1',
                                            children: [
                                                { id: '设备主任3' },
                                                { id: '技术主任3' },
                                                { id: '注射剂车间' },
                                            ],
                                        },
                                        {
                                            id: '中药提取利润中心',
                                            children: [
                                                { id: '设备主任4' },
                                                { id: '技术主任4' },
                                                { id: '中药提取车间' },
                                            ],
                                        },
                                    ],
                                },
                                {
                                    id: '奋勇生产基地',
                                    children: [
                                        { id: '设备管理部2' },
                                        { id: '安全生产管理部2' },
                                        { id: '后勤组' },
                                        { id: '安保组' },
                                        {
                                            id: '质量管理部',
                                            children: [{ id: '仓库' }],
                                        },
                                        {
                                            id: '中草药提取利润中心',
                                            children: [
                                                { id: '设备主任5' },
                                                { id: '技术主任5' },
                                                { id: '中草药提取二车间' },
                                            ],
                                        },
                                        {
                                            id: '注射剂利润中心2',
                                            children: [
                                                { id: '设备主任6' },
                                                { id: '技术主任6' },
                                                { id: '注射剂二车间' },
                                            ],
                                        },
                                    ],
                                },
                                {
                                    id: '营销利润中心',
                                    children: [
                                        {
                                            id: '市场部',
                                            children: [{ id: '公共事业部' }],
                                        },
                                        {
                                            id: '经营管理部2',
                                            children: [
                                                { id: '营销费用管理部' },
                                                { id: '商务部' },
                                            ],
                                        },
                                    ],
                                },
                                {
                                    id: '物流利润中心',
                                    children: [
                                        { id: '事业经营管理部' },
                                        { id: '物控部' },
                                        { id: '配送调度部' },
                                        { id: '采购部' },
                                    ],
                                },
                            ],
                        },
                    ],
                },
            ],
        },
    ],
};
